01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC 9(6).  

PROCEDURE DIVISION.
    MOVE 'Hello, World!' TO WS-AREA-1
    COMPUTE WS-AREA-2 = FUNCTION LENGTH(WS-AREA-1) 
    DISPLAY WS-AREA-2
    STOP RUN.